// 규칙성을 어떻게든...
#include <iostream>
#include <vector>

int main()
{
    int t;
    std::cin>>t;
    std::vector<std::vector<long long>> dp(100001,std::vector<long long>(4,0));
    dp[1][1] = 1;
    dp[1][2] = 0;
    dp[1][3] = 0;
    dp[2][1] = 0;
    dp[2][2] = 1;
    dp[2][3] = 0;
    dp[3][1] = 1;
    dp[3][2] = 1;
    dp[3][3] = 1;

    for(int i = 4; i < 100001; i++)
    {
        dp[i][1] = (dp[i-1][2] % 1000000009 + dp[i-1][3] % 1000000009) % 1000000009;
        dp[i][2] = (dp[i-2][1] % 1000000009 + dp[i-2][3] % 1000000009) % 1000000009;
        dp[i][3] = (dp[i-3][1] % 1000000009+ dp[i-3][2] % 1000000009)% 1000000009;
    }

    for(int i=0;i<t;i++)
    {
        int x;
        std::cin>>x;
        std::cout<<((dp[x][1]  % 1000000009+ dp[x][2]  % 1000000009) % 1000000009+ dp[x][3] % 1000000009) % 1000000009<<"\n";
    }
}